Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: The Keyboard has a **default event handler** callback called :cpp:func:`lv_keyboard_def_event_cb`, which handles the button pressing, map changing, sending events to the assigned text area, etc.
it_it: La tastiera dispone di un **gestore eventi predefinito** chiamato :cpp:func:`lv_keyboard_def_event_cb`, che gestisce la pressione del pulsante, il cambio di mappa, l'invio di eventi all'area di testo assegnata, ecc.

source: The Keyboard's ``TEXT``-mode layout contains buttons to change mode.
it_it: Il layout della modalità ``TEXT`` della tastiera contiene pulsanti per cambiare modalità.

source: The LVGL API is followed as much as possible, e.g., ``align="center"``, ``bg_color="0xff0000"``.
it_it: L'API LVGL viene seguita il più possibile, ad esempio ``align="center"``, ``bg_color="0xff0000"``.

source: The LVGL Barcode utility enables you to generate Code-128 bar codes.
it_it: L'utility LVGL Barcode consente di generare codici a barre Code-128.

source: The LVGL EVE renderer will call this callback to perform SPI communication with the EVE chip.
it_it: Il renderer EVE LVGL chiamerà questa callback per eseguire la comunicazione SPI con il chip EVE.

source: The LVGL Editor VS Code extension will create a `ui` sub-folder for the LVGL project and derive configuration from the Renesas `configuration.xml` file.
it_it: L'estensione LVGL Editor di VS Code creerà una sottocartella `ui` per il progetto LVGL e ricaverà la configurazione dal file `configuration.xml` di Renesas.

source: The LVGL Editor plugin will attempt to determine the currently active project in the IDE.
it_it: Il plugin LVGL Editor tenterà di determinare il progetto attualmente attivo nell'IDE.

source: The LVGL Editor provides a Node-based command line tool, ``lved-cli.js``, for generating/compiling code from XML, validating projects, syncing from Figma, comparing trees, and running headless UI tests.
it_it: L'editor LVGL fornisce uno strumento a riga di comando basato su Node, ``lved-cli.js``, per generare/compilare codice da XML, convalidare progetti, sincronizzare da Figma, confrontare alberi ed eseguire test dell'interfaccia utente headless.

source: The LVGL FreeType extension is an interface to the FreeType library, enabling you to generate font bitmaps at run time from most vector- and bitmap-font file formats.
it_it: L'estensione LVGL FreeType è un'interfaccia alla libreria FreeType, che consente di generare bitmap di font in fase di esecuzione dalla maggior parte dei formati di file di font vettoriali e bitmap.

source: The LVGL Repository
it_it: Il Repository LVGL

source: The LVGL XML Specification (the "Specification") defines an XML-based language for describing user interfaces within the LVGL ecosystem.
it_it: La Specifica XML LVGL (la "Specifica") definisce un linguaggio basato su XML per la descrizione delle interfacce utente all'interno dell'ecosistema LVGL.

source: The LVGL `Kconfig` file provides the available config options to the NuttX build system.
it_it: Il file `Kconfig` di LVGL fornisce le opzioni di configurazione disponibili per il sistema di build di NuttX.

source: The LVGL ``fbdev`` (frame buffer) display driver can almost always be used.
it_it: Il driver video LVGL ``fbdev`` (frame buffer) può essere utilizzato quasi sempre.

source: The LVGL benchmark should run on your Alif board after flashing completes.
it_it: Il benchmark LVGL dovrebbe essere eseguito sulla scheda Alif al termine del flashing.

source: The LVGL cmake system is made to be integrated into higher level projects.
it_it: Il sistema cmake di LVGL è progettato per essere integrato in progetti di livello superiore.

source: The LVGL configs in ``menuconfig`` can be found under **Application Configuration > Graphics Support > Light and Versatile Graphic Library (LVGL) > LVGL configuration**.
it_it: Le configurazioni LVGL in ``menuconfig`` si trovano in **Application Configuration > Graphics Support > Light and Versatile Graphic Library (LVGL) > LVGL configuration**.

source: The LVGL display driver for Espressif operates by reading the descriptor of the drawn data to check if rotation and mirror are flags set on the data properties, in positive case, before sending the data to the display, the mirror and rotation are performed first using the PPA rotation and mirror client.
it_it: Il driver del display LVGL per Espressif legge il descrittore dei dati disegnati per verificare se rotazione e mirroring sono impostati come flag nelle proprietà dei dati; in caso positivo, prima di inviare i dati al display, il mirroring e la rotazione vengono eseguiti utilizzando il client di rotazione e mirroring del PPA.

source: The LVGL does not interact directly to the DMA2D, instead, the Espressif LVGL port component display driver uses the DMA2D to copy the target drawn buffer to the display buffer without CPU intervention.
it_it: LVGL non interagisce direttamente con DMA2D; il porting del driver del display di LVGL di Espressif utilizza DMA2D per copiare il buffer di disegno di destinazione in quello del display senza l'intervento della CPU.

source: The LVGL driver for eLCDIF assumes the platform already configured the display low-level driver, set the pin-mux, clocks, etc.
it_it: Il driver LVGL per eLCDIF presuppone che la piattaforma abbia già configurato il driver di basso livello del display, impostato il pin-mux, i clock, ecc.

source: The LVGL file system will always be used when an image is loaded with :cpp:func:`lv_image_set_src` regardless of the value of :c:macro:`LV_FFMPEG_PLAYER_USE_LV_FS`.
it_it: Il file system LVGL verrà sempre utilizzato quando un'immagine viene caricata con :cpp:func:`lv_image_set_src`, indipendentemente dal valore di :c:macro:`LV_FFMPEG_PLAYER_USE_LV_FS`.

source: The LVGL is supported by Espressif SDK, that is it, the IDF as mentioned before, therefore ESP32 series of chips are supported on a different sets of frameworks called by Espressif as 3rd party projects.
it_it: LVGL è supportato dall'SDK di Espressif, ovvero l'IDF, come accennato in precedenza. Pertanto, la serie di chip ESP32 è supportata da diversi set di framework, definiti da Espressif "progetti di terze parti".

source: The LVGL library is a NuttX "app".
it_it: La libreria LVGL è una "app" di NuttX.

source: The LVGL logs are not enabled by default, for enable it, add the following options on the `sdkconfig.defaults`:
it_it: I log LVGL non sono abilitati di default; per farlo, si aggiungono le seguenti opzioni a `sdkconfig.defaults`:

source: The LVGL project (including all repositories) is licensed under the `MIT license <https://github.com/lvgl/lvgl/blob/master/LICENCE.txt>`__.
it_it: Il progetto LVGL (inclusi tutti i repository) è concesso con la `licenza MIT <https://github.com/lvgl/lvgl/blob/master/LICENCE.txt>`__.

source: The LVGL's NXP eLCDIF driver is responsible to bind the NXP MCUx SDK low-level driver to the LVGL display subsystem.
it_it: Il driver NXP eLCDIF di LVGL è responsabile del "bind" [collegamento] del driver di basso livello dell'SDK MCUx di NXP al sottosistema di visualizzazione LVGL.

source: The LVGL's built-in binary image decoder supports LZ4-compressed images.
it_it: Il decodificatore di immagini binarie nativo in LVGL supporta le immagini compresse con LZ4.

source: The LVGL's built-in binary image decoder supports RLE-compressed images.
it_it: Il decoder di immagini binarie nativo in LVGL supporta immagini compresse con RLE.

source: The LZ4 compression is a lossless compression method.
it_it: La compressione LZ4 è un metodo di compressione senza perdita di dati.

source: The Label will display the value with "%0.1f" format string.
it_it: La Label visualizzerà il valore con la stringa di formato "%0.1f".

source: The Label will simply display the number.
it_it: La Label visualizzerà semplicemente il numero.

source: The Labels can display symbols alongside letters (or on their own).
it_it: Le etichette possono visualizzare simboli accanto alle lettere (o da soli).

source: The Launch Screen opens up every time you start the Editor and are already logged in.
it_it: La "Launch Screen" [schermata di avvio] si apre ogni volta che si avvia l'Editor e si è già effettuato l'accesso.

source: The Line Widget is capable of drawing straight lines between a set of points.
it_it: Il Widget "Line" è in grado di disegnare linee rette tra un insieme di punti.

source: The Linux event device (evdev) is a hardware-independent API that gives access to input events from, for example, a mouse or touchscreen.
it_it: "Event device" (evdev) di Linux, è un'API indipendente dall'hardware che consente l'accesso agli eventi di input, ad esempio da un mouse o da un touchscreen.

source: The Linux framebuffer (fbdev) is a linux subsystem used to display graphics.
it_it: Il framebuffer Linux (fbdev) è un sottosistema Linux utilizzato per visualizzare la grafica.

source: The List Widget is basically a rectangle with vertical layout to which Buttons and Text can be added.
it_it: Il Widget List è fondamentalmente un rettangolo con layout verticale a cui è possibile aggiungere Pulsanti e Testo.

source: The Location field indicates where to find this option.
it_it: Il campo "Location" indica dove trovare questa opzione.

source: The Lottie Widget is based on :ref:`lv_canvas` because in order to render the animation the user needs to provide a buffer where the current animation frame is stored.
it_it: Il Widget Lottie si basa su :ref:`lv_canvas` perché per eseguire il rendering dell'animazione l'utente deve fornire un buffer in cui memorizzare il fotogramma corrente.

source: The Lottie Widget is capable of parsing, rasterizing, and playing `Lottie animations <https://lottiefiles.com>`__.
it_it: Il Widget Lottie è in grado di analizzare, rasterizzare e riprodurre le `animazioni Lottie <https://lottiefiles.com>`__.

source: The Lottie Widget uses the `ThorVG <https://github.com/thorvg/thorvg>`__ library which is `integrated into LVGL <https://github.com/lvgl/lvgl/tree/master/src/libs/thorvg>`__.
it_it: Il Widget Lottie utilizza la libreria `ThorVG <https://github.com/thorvg/thorvg>`__ che è `integrata in LVGL <https://github.com/lvgl/lvgl/tree/master/src/libs/thorvg>`__.

source: The Lottie animations are vector-based animations.
it_it: Le animazioni Lottie sono animazioni vettoriali.

source: The MCU can go to sleep when no user input has been received for a certain period.
it_it: L'MCU può entrare in modalità sleep quando non riceve input dall'utente per un certo periodo di tempo.

source: The MCU has an LCD driver peripheral which LVGL uses to update the display.
it_it: L'MCU è dotato di una periferica driver LCD che LVGL utilizza per aggiornare il display.

source: The MIT license requires a copyright notice be added to the derived work.
it_it: La licenza MIT richiede l'aggiunta di una nota di copyright all'opera derivata.

source: The Menu Widget can be used to create multi-level menus that automatically handle navigation among menu levels, and enable its user to capture page navigation and click events.
it_it: Il Widget Menu può essere utilizzato per creare menù multilivello che gestiscono automaticamente la navigazione tra i livelli di menù e consentono all'utente di catturare la navigazione tra le pagine e gli eventi di clic.

source: The Menu Widget is built from the following Widgets:
it_it: Il Widget Menu è costituito dai seguenti Widget:

source: The MicroPython Binding is auto generated!
it_it: Il Binding MicroPython è generato automaticamente!

source: The Monkey module provides LVGL applications with a simple monkey test.
it_it: Il modulo Monkey fornisce alle applicazioni LVGL un semplice test Monkey.

source: The NV3007 LCD controller `driver <https://github.com/lvgl/lvgl/tree/master/src/drivers/display/nv3007>`__ is a platform-agnostic driver, based on the :ref:`generic MIPI driver`.
it_it: Il `driver <https://github.com/lvgl/lvgl/tree/master/src/drivers/display/nv3007>`__ del controller LCD NV3007 è un driver indipendente dalla piattaforma, basato sul :ref:`driver MIPI generico`.

source: The NeoChrom VG driver in LVGL can render vector graphics Widgets using NeoChrom VG's hardware support for vector graphics drawing.
it_it: Il driver NeoChrom VG in LVGL può eseguire il rendering di Widget di grafica vettoriale utilizzando il supporto hardware di NeoChrom VG per il "vector graphics drawing".

source: The NuttX X11 sim keyboard driver emits keycodes that are not standard so the LVGL integration with it would not be generic, if it were added.
it_it: Il driver della tastiera sim NuttX X11 emette codici tasto non standard, quindi l'integrazione di LVGL con esso non sarebbe generica, se fosse aggiunto.

source: The NuttX simulator allows you to run NuttX and LVGL on your PC.
it_it: Il simulatore NuttX consente di eseguire NuttX e LVGL sul PC.

source: The OpenEmbedded build system does not need the aid of PR to know when to rebuild a recipe.
it_it: Il sistema di build di OpenEmbedded non ha bisogno dell'ausilio del PR per sapere quando ri-buildare una ricetta.

source: The OpenGL context must be created by the user or they can use GLFW or EGL as backends.
it_it: Il contesto OpenGL deve essere creato dall'utente oppure è possibile utilizzare GLFW o EGL come backend.

source: The OpenGL implementation provides significant performance benefits in most scenarios:
it_it: L'implementazione OpenGL offre significativi vantaggi in termini di prestazioni nella maggior parte degli scenari:

source: The OpenGL integration consists of two main components:
it_it: L'integrazione di OpenGL consiste in due componenti principali:

source: The OpenGL support in LVGL is intended to be portable between different APIs.
it_it: Il supporto OpenGL in LVGL è progettato per essere portabile tra diverse API.

source: The Output Pane contains a number of tabs where you can see various results, and manage certain lists as part of your project.
it_it: Il Pannello Output contiene diversi "tab" [schede] in cui è possibile visualizzare vari risultati e gestire determinati elenchi come parte del progetto.

source: The PR variable primarily becomes significant when a package manager dynamically installs packages on an already built image.
it_it: La variabile PR diventa significativa principalmente quando un gestore di pacchetti installa dinamicamente i pacchetti su un'immagine già compilata.

source: The RLE algorithm is a simple compression algorithm that is based on the fact that for many adjacent pixels, the color is the same.
it_it: L'algoritmo RLE è un semplice algoritmo di compressione basato sul fatto che per molti pixel adiacenti il colore è lo stesso.

source: The RLE compression is a lossless compression method.
it_it: La compressione RLE è un metodo di compressione senza perdita di dati.

source: The RLE image can then be used in the same way as other images.
it_it: L'immagine RLE può quindi essere utilizzata allo stesso modo di altre immagini.

source: The RZ/A boards are MPUs with a focus on bare metal and RTOS applications.
it_it: Le schede RZ/A sono MPU con un focus su applicazioni "bare-metal" e RTOS.

source: The RZ/G2L and RZ/G2UL are MPUs with support for running Linux.
it_it: RZ/G2L e RZ/G2UL sono MPU che supportano l'esecuzione di Linux.

source: The RZ/G3E is a high-performance quad-core MPU.
it_it: RZ/G3E è una CPU quad-core ad alte prestazioni.

source: The SDK calls the GPU initialization function on its own during system startup, and the GPU is available when LVGL starts; set :c:macro:`LV_VG_LITE_USE_GPU_INIT` to 0.
it_it: L'SDK richiama autonomamente la funzione di inizializzazione della GPU durante l'avvio del sistema e la GPU è disponibile all'avvio di LVGL; impostare :c:macro:`LV_VG_LITE_USE_GPU_INIT` a 0.

source: The SDK currently uses LVGL v8.3 so this project uses this version to mirror the SDK version, even though LVGL is statically linked.
it_it: L'SDK attualmente utilizza LVGL v8.3, quindi questo progetto utilizza questa versione per rispecchiare la versione dell'SDK, anche se LVGL è linkato staticamente.

source: The SDK is installed.
it_it: L'SDK è installato.

source: The SDK is intended for a Linux PC environment (WSL, Docker, etc. can be used on Windows).
it_it: L'SDK è progettato per un ambiente PC Linux (WSL, Docker, ecc. possono essere utilizzati su Windows).

source: The SDKs are generated when you use the ``bitbake -c populate_sdk`` command.
it_it: Gli SDK vengono generati quando si utilizza il comando ``bitbake -c populate_sdk``.

source: The SHM backend is enabled by default and requires no additional configuration.
it_it: Il backend SHM è abilitato di default e non richiede configurazioni aggiuntive.

source: The SPI interface is simpler to connect than parallel RGB especially if the EVE chip is integrated into a display assembly.
it_it: L'interfaccia SPI è più semplice da collegare rispetto all'RGB parallelo, soprattutto se il chip EVE è integrato in un display.

source: The ST7735 LCD controller `driver <https://github.com/lvgl/lvgl/tree/master/src/drivers/display/st7735>`__ is a platform-agnostic driver, based on the :ref:`generic MIPI driver`.
it_it: Il `driver <https://github.com/lvgl/lvgl/tree/master/src/drivers/display/st7735>`__ del controller LCD ST7735 è un driver indipendente dalla piattaforma, basato sul :ref:`driver MIPI generico`.

source: The ST7789 LCD controller `driver <https://github.com/lvgl/lvgl/tree/master/src/drivers/display/st7789>`__ is a platform-agnostic driver, based on the :ref:`generic MIPI driver`.
it_it: Il `driver <https://github.com/lvgl/lvgl/tree/master/src/drivers/display/st7789>`__ del controller LCD ST7789 è un driver indipendente dalla piattaforma, basato sul :ref:`driver MIPI generico`.

source: The ST7796 LCD controller `driver <https://github.com/lvgl/lvgl/tree/master/src/drivers/display/st7796>`__ is a platform-agnostic driver, based on the :ref:`generic MIPI driver`.
it_it: Il `driver <https://github.com/lvgl/lvgl/tree/master/src/drivers/display/st7796>`__ del controller LCD ST7796 è un driver indipendente dalla piattaforma, basato sul :ref:`driver MIPI generico`.

source: The ST7796S is capable of connecting directly to an external microprocessor, and accepts 8-bit/9-bit/16-bit/18-bit parallel interface, SPI, and the ST7796S also provides MIPI interface.
it_it: ST7796S è in grado di connettersi direttamente a un microprocessore esterno e accetta interfacce parallele a 8/9/16/18 bit, SPI; inoltre, fornisce anche un'interfaccia MIPI.

source: The STM32 Embedded Displays have an STM32 MCU onboard which makes it possible to embed an entire application into the device.
it_it: I display embedded STM32 sono dotati di un MCU STM32 integrato che consente di integrare un'intera applicazione nel dispositivo.

source: The STM32 HAL is maintained by ST and is a good fit for many applications.
it_it: STM32 HAL è gestito da ST ed è adatto a molte applicazioni.

source: The Scale Widget has the following three parts:
it_it: Il Widget "Scale" è composto dalle seguenti tre parti:

source: The Single-Board Computer Displays are ready to use with :ref:`Toradex <toradex>` Dahlia and Mallow carrier boards.
it_it: I Single-Board Computer Displays sono pronti per l'uso con le schede carrier Dahlia e Mallow :ref:`Toradex <toradex>`.

source: The Slider Widget looks like a :ref:`lv_bar` supplemented with a knob.
it_it: Il Widget Slider ha l'aspetto di una :ref:`lv_bar` con una manopola.

source: The Slider can be in one of the following modes:
it_it: Lo Slider può essere in una delle seguenti modalità:

source: The Spangroup Widget is used to display rich text.
it_it: Il Widget Spangroup viene utilizzato per visualizzare testo formattato.

source: The Spinner Widget is a spinning arc over a ring, typically used to show some type of activity is in progress.
it_it: Il Widget Spinner è un arco rotante lungo un anello, solitamente utilizzato per indicare che è in corso un'attività.

source: The Style properties that are used during Scale drawing (and are thus useful) are:
it_it: Le proprietà di Stile utilizzate durante il disegno della "Scale" (e quindi utili) sono:

source: The Subject can be a STRING, POINTER, INTEGER, or FLOAT type.
it_it: Il Subject può essere di tipo STRING, POINTER, INTEGER o FLOAT.

source: The Switch uses the standard :cpp:enumerator:`LV_STATE_CHECKED` state.
it_it: Lo Switch utilizza lo stato standard :cpp:enumerator:`LV_STATE_CHECKED` state.

source: The System Monitor module provides real-time monitoring of system performance metrics directly on your display.
it_it: Il modulo System Monitor fornisce il monitoraggio in tempo reale delle metriche delle prestazioni del sistema direttamente sul display.

source: The TSC 4/6/6A/12/12A color formats are part of :cpp:type:`lv_color_format_t`.
it_it: I formati colore TSC 4/6/6A/12/12A fanno parte di :cpp:type:`lv_color_format_t`.

source: The TTF ``TerminusMedium-001.000.ttf`` will be created from ``./TerminusMedium-12-12.bdf``.
it_it: Il TTF ``TerminusMedium-001.000.ttf`` verrà creato da ``./TerminusMedium-12-12.bdf``.

source: The Tab View Widget can be used to organize content in tabs.
it_it: Il Widget "Tab View" [Visualizzazione schede] può essere utilizzato per organizzare i contenuti in schede.

source: The Tab View is built from other Widgets:
it_it: La "Tab View" è composta da altri Widget:

source: The Table Widget is very lightweight because only the text strings are stored.
it_it: Il Widget Table è molto leggero perché memorizza solo le stringhe di testo.

source: The Table is added to the default group (if one is set).
it_it: La Tabella viene aggiunta al gruppo di default (se impostato).

source: The Test module can be enabled by configuring ``LV_USE_TEST`` to a non-zero value, and it consists of the following components:
it_it: Il modulo Test può essere abilitato configurando ``LV_USE_TEST`` su un valore diverso da zero ed è costituito dai seguenti componenti:

source: The Test module provides functions to emulate clicks, key presses, encoder turns, time passing, and compare the UI with reference images.
it_it: Il modulo di Test fornisce funzioni per emulare clic, pressioni di tasti, rotazioni dell'encoder, il trascorrere del tempo e confrontare l'interfaccia utente con immagini di riferimento.

source: The Text Area can be configured to keep all text on a single line with :cpp:expr:`lv_textarea_set_one_line(textarea, true)`.
it_it: La Text Area può essere configurata per mantenere tutto il testo su una singola riga con :cpp:expr:`lv_textarea_set_one_line(textarea, true)`.

source: The Text Area is a :ref:`base_widget` with a :ref:`lv_label` and a cursor on it.
it_it: La Text Area è un :ref:`base_widget` con una :ref:`lv_label` e un cursore.

source: The Text Area supports password mode which can be enabled with :cpp:expr:`lv_textarea_set_password_mode(textarea, true)`.
it_it: La Text Area supporta la modalità password, che può essere abilitata con :cpp:expr:`lv_textarea_set_password_mode(textarea, true)`.

source: The Tile View can scroll to a specified tile with :cpp:expr:`lv_tileview_set_tile(tileview, tile, LV_ANIM_ON/OFF)` or :cpp:expr:`lv_tileview_set_tile_by_index(tileview, col_id, row_id, LV_ANIM_ON/OFF)`.
it_it: La Tile View può scorrere fino a un tile specificato con :cpp:expr:`lv_tileview_set_tile(tileview, tile, LV_ANIM_ON/OFF)` o con :cpp:expr:`lv_tileview_set_tile_by_index(tileview, col_id, row_id, LV_ANIM_ON/OFF)`.

source: The Tile View is a container Widget whose elements (called *tiles*) can be arranged in grid form.
it_it: La Tile View è un Widget contenitore i cui elementi (chiamati *tile*) possono essere disposti in una griglia.
